---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.DuctSizeSettingIterator.MoveNext
source: html/2a6a0744-cc6c-8672-26ca-f69cf68c6725.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSizeSettingIterator.MoveNext Method

Increments the enumerator to the next item.

## Syntax (C#)
```csharp
public virtual bool MoveNext()
```

## Returns
True if there is a next available item in this enumerator.
 False if the enumerator has completed all available items.